IDENTIFICATION DIVISION.
PROGRAM-ID. BCRAST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(04).
01 LS-ACT PIC X(12).
01 LS-NXT PIC X(04).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "SUBMIT" PERFORM DO-SUBMIT
        WHEN "APPROVE" PERFORM DO-APPROVE
        WHEN "CONDITION" PERFORM DO-CONDITION
        WHEN "SATISFY" PERFORM DO-SATISFY
        WHEN "REJECT" PERFORM DO-REJECT
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "EXPIRE" PERFORM DO-EXPIRE
        WHEN "CONTRACT" PERFORM DO-CONTRACT
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN APPLICATION ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-SUBMIT.
    IF LS-CUR = "RCV"
        MOVE "UND" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-APPROVE.
    IF LS-CUR = "RCV" OR LS-CUR = "UND"
        MOVE "APV" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-CONDITION.
    IF LS-CUR = "RCV" OR LS-CUR = "UND"
        MOVE "CND" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-SATISFY.
    IF LS-CUR = "CND"
        MOVE "APV" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-REJECT.
    EVALUATE LS-CUR
        WHEN "RCV" MOVE "REJ" TO LS-NXT
        WHEN "UND" MOVE "REJ" TO LS-NXT
        WHEN "CND" MOVE "REJ" TO LS-NXT
        WHEN "APV" MOVE "REJ" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "RCV" MOVE "CAN" TO LS-NXT
        WHEN "UND" MOVE "CAN" TO LS-NXT
        WHEN "CND" MOVE "CAN" TO LS-NXT
        WHEN "APV" MOVE "CAN" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-EXPIRE.
    EVALUATE LS-CUR
        WHEN "RCV" MOVE "EXP" TO LS-NXT
        WHEN "UND" MOVE "EXP" TO LS-NXT
        WHEN "CND" MOVE "EXP" TO LS-NXT
        WHEN "APV" MOVE "EXP" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CONTRACT.
    IF LS-CUR = "APV"
        MOVE "CON" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID APPLICATION TRANSITION" TO LS-MSG.
