IDENTIFICATION DIVISION.
PROGRAM-ID. BCRFST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(04).
01 LS-ACT PIC X(12).
01 LS-NXT PIC X(04).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "APPROVE" PERFORM DO-APPROVE
        WHEN "CONTRACT" PERFORM DO-CONTRACT
        WHEN "ACTIVATE" PERFORM DO-ACTIVATE
        WHEN "SUSPEND" PERFORM DO-SUSPEND
        WHEN "RESUME" PERFORM DO-RESUME
        WHEN "BLOCK" PERFORM DO-BLOCK
        WHEN "UNBLOCK" PERFORM DO-UNBLOCK
        WHEN "EXPIRE" PERFORM DO-EXPIRE
        WHEN "MATURE" PERFORM DO-MATURE
        WHEN "CLOSE" PERFORM DO-CLOSE
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "DEFAULT" PERFORM DO-DEFAULT
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN FACILITY ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-APPROVE.
    IF LS-CUR = "REQ"
        MOVE "APV" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-CONTRACT.
    IF LS-CUR = "APV"
        MOVE "CON" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-ACTIVATE.
    IF LS-CUR = "CON"
        MOVE "ACT" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-SUSPEND.
    IF LS-CUR = "ACT"
        MOVE "SUS" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-RESUME.
    IF LS-CUR = "SUS"
        MOVE "ACT" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-BLOCK.
    IF LS-CUR = "ACT"
        MOVE "BLK" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-UNBLOCK.
    IF LS-CUR = "BLK"
        MOVE "ACT" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-EXPIRE.
    EVALUATE LS-CUR
        WHEN "REQ" MOVE "EXP" TO LS-NXT
        WHEN "APV" MOVE "EXP" TO LS-NXT
        WHEN "CON" MOVE "EXP" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-MATURE.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "MAT" TO LS-NXT
        WHEN "SUS" MOVE "MAT" TO LS-NXT
        WHEN "BLK" MOVE "MAT" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CLOSE.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "CLO" TO LS-NXT
        WHEN "SUS" MOVE "CLO" TO LS-NXT
        WHEN "BLK" MOVE "CLO" TO LS-NXT
        WHEN "MAT" MOVE "CLO" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "REQ" MOVE "CAN" TO LS-NXT
        WHEN "APV" MOVE "CAN" TO LS-NXT
        WHEN "CON" MOVE "CAN" TO LS-NXT
        WHEN "ACT" MOVE "CAN" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-DEFAULT.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "DEF" TO LS-NXT
        WHEN "SUS" MOVE "DEF" TO LS-NXT
        WHEN "BLK" MOVE "DEF" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID FACILITY TRANSITION" TO LS-MSG.
