IDENTIFICATION DIVISION.
PROGRAM-ID. BPXCYM.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LC-CUR PIC X(16).
01 LC-EVT PIC X(20).
01 LC-NXT PIC X(16).
01 LC-RC PIC X(02).
01 LC-MSG PIC X(80).

PROCEDURE DIVISION USING LC-CUR LC-EVT LC-NXT LC-RC LC-MSG.
    MOVE "00" TO LC-RC
    MOVE SPACES TO LC-MSG LC-NXT
    EVALUATE TRUE
        WHEN LC-EVT = "ACCRUE"
            IF LC-CUR = "OPEN" OR LC-CUR = "ACCUMULATING"
                MOVE "ACCUMULATING" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "CLOSE"
            IF LC-CUR = "OPEN" OR LC-CUR = "ACCUMULATING" OR
               LC-CUR = "CALCULATED"
                MOVE "CLOSED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "CALCULATE"
            IF LC-CUR = "CLOSED"
                MOVE "CALCULATED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "CALC-FAIL"
            IF LC-CUR = "CLOSED"
                MOVE "CALC-FAILED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "RECALCULATE"
            IF LC-CUR = "CALC-FAILED"
                MOVE "CALCULATED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "SUBMIT"
            IF LC-CUR = "CALCULATED"
                MOVE "SUBMITTED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "SUBMIT-FAIL"
            IF LC-CUR = "CALCULATED"
                MOVE "SUBMIT-FAILED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "RESUBMIT"
            IF LC-CUR = "SUBMIT-FAILED"
                MOVE "SUBMITTED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "UNKNOWN"
            IF LC-CUR = "SUBMITTED"
                MOVE "UNKNOWN" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "SETTLE"
            IF LC-CUR = "SUBMITTED" OR LC-CUR = "UNKNOWN" OR
               LC-CUR = "CALCULATED"
                MOVE "SETTLED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "SETTLE-FAIL"
            IF LC-CUR = "SUBMITTED" OR LC-CUR = "UNKNOWN"
                MOVE "SETTLE-FAILED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "RECONCILE"
            IF LC-CUR = "SETTLED" OR LC-CUR = "RECON-EXCEPTION" OR
               LC-CUR = "SUBMITTED" OR LC-CUR = "UNKNOWN"
                MOVE "RECONCILED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "RECON-EXCEPTION"
            IF LC-CUR = "SETTLED" OR LC-CUR = "RECONCILED" OR
               LC-CUR = "SUBMITTED" OR LC-CUR = "UNKNOWN"
                MOVE "RECON-EXCEPTION" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN LC-EVT = "CANCEL"
            IF LC-CUR = "OPEN" OR LC-CUR = "ACCUMULATING" OR
               LC-CUR = "CLOSED" OR LC-CUR = "CALCULATED" OR
               LC-CUR = "CALC-FAILED" OR LC-CUR = "SUBMIT-FAILED"
                MOVE "CANCELLED" TO LC-NXT
            ELSE PERFORM LC-INVALID
        WHEN OTHER
            MOVE "99" TO LC-RC
            MOVE "UNKNOWN CYCLE EVENT" TO LC-MSG
    END-EVALUATE
    IF LC-RC = "00" AND LC-NXT = SPACES
        PERFORM LC-INVALID
    END-IF
    GOBACK.

LC-INVALID.
    MOVE "20" TO LC-RC
    STRING "CYCLE STATE " DELIMITED SIZE LC-CUR DELIMITED SIZE
        " REJECTS EVENT " DELIMITED SIZE LC-EVT DELIMITED SIZE
        INTO LC-MSG
    END-STRING
    MOVE LC-CUR TO LC-NXT.
