IDENTIFICATION DIVISION.
PROGRAM-ID. CLTST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(12).
01 LS-ACT PIC X(16).
01 LS-NXT PIC X(12).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "VALIDATE" PERFORM DO-VALIDATE
        WHEN "INVALIDATE" PERFORM DO-INVALIDATE
        WHEN "REVIEW" PERFORM DO-REVIEW
        WHEN "REINSTATE" PERFORM DO-REINSTATE
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "EXPIRE" PERFORM DO-EXPIRE
        WHEN "RELEASE-START" PERFORM DO-RELEASE-START
        WHEN "RELEASE-OK" PERFORM DO-RELEASE-OK
        WHEN "RELEASE-NO" PERFORM DO-RELEASE-NO
        WHEN "PLEDGE-PART" PERFORM DO-PLEDGE-PART
        WHEN "PLEDGE-FULL" PERFORM DO-PLEDGE-FULL
        WHEN "FREE-PART" PERFORM DO-FREE-PART
        WHEN "FREE-ALL" PERFORM DO-FREE-ALL
        WHEN "ENCUMBER" PERFORM DO-ENCUMBER
        WHEN "SUB-START" PERFORM DO-SUB-START
        WHEN "SUB-CANCEL" PERFORM DO-SUB-CANCEL
        WHEN "SUB-DONE" PERFORM DO-SUB-DONE
        WHEN "ENF-START" PERFORM DO-ENF-START
        WHEN "ENF-DONE" PERFORM DO-ENF-DONE
        WHEN "REC-START" PERFORM DO-REC-START
        WHEN "REC-DONE" PERFORM DO-REC-DONE
        WHEN "REC-NO" PERFORM DO-REC-NO
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN COLLATERAL ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-VALIDATE.
    EVALUATE LS-CUR
        WHEN "REGISTER" MOVE "VALID" TO LS-NXT
        WHEN "PENDVALID" MOVE "VALID" TO LS-NXT
        WHEN "VALID" MOVE "VALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-INVALIDATE.
    EVALUATE LS-CUR
        WHEN "REGISTER" MOVE "INVALID" TO LS-NXT
        WHEN "PENDVALID" MOVE "INVALID" TO LS-NXT
        WHEN "VALID" MOVE "INVALID" TO LS-NXT
        WHEN "PARTPLED" MOVE "INVALID" TO LS-NXT
        WHEN "PLEDGED" MOVE "INVALID" TO LS-NXT
        WHEN "ENCUMBER" MOVE "INVALID" TO LS-NXT
        WHEN "EXPIRED" MOVE "INVALID" TO LS-NXT
        WHEN "INVALID" MOVE "INVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REVIEW.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "PENDVALID" TO LS-NXT
        WHEN "PARTPLED" MOVE "PENDVALID" TO LS-NXT
        WHEN "PLEDGED" MOVE "PENDVALID" TO LS-NXT
        WHEN "ENCUMBER" MOVE "PENDVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REINSTATE.
    EVALUATE LS-CUR
        WHEN "EXPIRED" MOVE "PENDVALID" TO LS-NXT
        WHEN "INVALID" MOVE "PENDVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "REGISTER" MOVE "CANCELLED" TO LS-NXT
        WHEN "PENDVALID" MOVE "CANCELLED" TO LS-NXT
        WHEN "VALID" MOVE "CANCELLED" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-EXPIRE.
    EVALUATE LS-CUR
        WHEN "PENDVALID" MOVE "EXPIRED" TO LS-NXT
        WHEN "VALID" MOVE "EXPIRED" TO LS-NXT
        WHEN "PARTPLED" MOVE "EXPIRED" TO LS-NXT
        WHEN "PLEDGED" MOVE "EXPIRED" TO LS-NXT
        WHEN "ENCUMBER" MOVE "EXPIRED" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-RELEASE-START.
    IF LS-CUR = "VALID"
        MOVE "RELPEND" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-RELEASE-OK.
    IF LS-CUR = "RELPEND"
        MOVE "RELEASED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-RELEASE-NO.
    IF LS-CUR = "RELPEND"
        MOVE "VALID" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-PLEDGE-PART.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "PARTPLED" TO LS-NXT
        WHEN "PARTPLED" MOVE "PARTPLED" TO LS-NXT
        WHEN "PLEDGED" MOVE "PLEDGED" TO LS-NXT
        WHEN "PENDVALID" MOVE "PENDVALID" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENCUMBER" TO LS-NXT
        WHEN "ENFORCEP" MOVE "ENFORCEP" TO LS-NXT
        WHEN "RECPEND" MOVE "RECPEND" TO LS-NXT
        WHEN "EXPIRED" MOVE "EXPIRED" TO LS-NXT
        WHEN "INVALID" MOVE "INVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-PLEDGE-FULL.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "PLEDGED" TO LS-NXT
        WHEN "PARTPLED" MOVE "PLEDGED" TO LS-NXT
        WHEN "PLEDGED" MOVE "PLEDGED" TO LS-NXT
        WHEN "PENDVALID" MOVE "PLEDGED" TO LS-NXT
        WHEN "ENFORCEP" MOVE "ENFORCEP" TO LS-NXT
        WHEN "RECPEND" MOVE "RECPEND" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENCUMBER" TO LS-NXT
        WHEN "EXPIRED" MOVE "EXPIRED" TO LS-NXT
        WHEN "INVALID" MOVE "INVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-FREE-PART.
    EVALUATE LS-CUR
        WHEN "RECPEND" MOVE "RECPEND" TO LS-NXT
        WHEN "PLEDGED" MOVE "PARTPLED" TO LS-NXT
        WHEN "PARTPLED" MOVE "PARTPLED" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENCUMBER" TO LS-NXT
        WHEN "PENDVALID" MOVE "PENDVALID" TO LS-NXT
        WHEN "EXPIRED" MOVE "EXPIRED" TO LS-NXT
        WHEN "INVALID" MOVE "INVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-FREE-ALL.
    EVALUATE LS-CUR
        WHEN "RECPEND" MOVE "RECPEND" TO LS-NXT
        WHEN "PLEDGED" MOVE "VALID" TO LS-NXT
        WHEN "PARTPLED" MOVE "VALID" TO LS-NXT
        WHEN "ENFORCEP" MOVE "VALID" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENCUMBER" TO LS-NXT
        WHEN "PENDVALID" MOVE "PENDVALID" TO LS-NXT
        WHEN "VALID" MOVE "VALID" TO LS-NXT
        WHEN "EXPIRED" MOVE "EXPIRED" TO LS-NXT
        WHEN "INVALID" MOVE "INVALID" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-ENCUMBER.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "ENCUMBER" TO LS-NXT
        WHEN "PARTPLED" MOVE "ENCUMBER" TO LS-NXT
        WHEN "PLEDGED" MOVE "ENCUMBER" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENCUMBER" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-SUB-START.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "SUBSTPT" TO LS-NXT
        WHEN "PARTPLED" MOVE "SUBSTPT" TO LS-NXT
        WHEN "PLEDGED" MOVE "SUBSTPT" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-SUB-CANCEL.
    IF LS-CUR = "SUBSTPT"
        MOVE "VALID" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-SUB-DONE.
    IF LS-CUR = "SUBSTPT"
        MOVE "SUBSTITD" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-ENF-START.
    EVALUATE LS-CUR
        WHEN "VALID" MOVE "ENFORCEP" TO LS-NXT
        WHEN "PARTPLED" MOVE "ENFORCEP" TO LS-NXT
        WHEN "PLEDGED" MOVE "ENFORCEP" TO LS-NXT
        WHEN "ENCUMBER" MOVE "ENFORCEP" TO LS-NXT
        WHEN "EXPIRED" MOVE "ENFORCEP" TO LS-NXT
        WHEN "INVALID" MOVE "ENFORCEP" TO LS-NXT
        WHEN "PENDVALID" MOVE "ENFORCEP" TO LS-NXT
        WHEN "ENFORCEP" MOVE "ENFORCEP" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-ENF-DONE.
    EVALUATE LS-CUR
        WHEN "ENFORCEP" MOVE "ENFORCED" TO LS-NXT
        WHEN "ENFORCED" MOVE "ENFORCED" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REC-START.
    EVALUATE LS-CUR
        WHEN "ENFORCED" MOVE "RECPEND" TO LS-NXT
        WHEN "RECPEND" MOVE "RECPEND" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REC-DONE.
    IF LS-CUR = "RECPEND"
        MOVE "RECOVERED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-REC-NO.
    IF LS-CUR = "RECPEND"
        MOVE "ENFORCED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID COLLATERAL TRANSITION" TO LS-MSG.
