IDENTIFICATION DIVISION.
PROGRAM-ID. BPAYSTT.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(02).
01 LS-ACT PIC X(08).
01 LS-NXT PIC X(02).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE TRUE
        WHEN LS-ACT = "VALIDATE"
            PERFORM DO-VALIDATE
        WHEN LS-ACT = "AUTHORIZE"
            PERFORM DO-AUTHORIZE
        WHEN LS-ACT = "PROCESS"
            PERFORM DO-PROCESS
        WHEN LS-ACT = "POST"
            PERFORM DO-POST
        WHEN LS-ACT = "SETTLE"
            PERFORM DO-SETTLE
        WHEN LS-ACT = "FAIL"
            PERFORM DO-FAIL
        WHEN LS-ACT = "RETURN"
            PERFORM DO-RETURN
        WHEN LS-ACT = "REVERSE"
            PERFORM DO-REVERSE
        WHEN LS-ACT = "CANCEL"
            PERFORM DO-CANCEL
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-VALIDATE.
    IF LS-CUR = "CR"
        MOVE "VA" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-AUTHORIZE.
    IF LS-CUR = "VA"
        MOVE "AU" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-PROCESS.
    IF LS-CUR = "AU"
        MOVE "PR" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-POST.
    IF LS-CUR = "PR"
        MOVE "ST" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-SETTLE.
    IF LS-CUR = "ST"
        MOVE "ST" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-FAIL.
    EVALUATE LS-CUR
        WHEN "CR" MOVE "RJ" TO LS-NXT
        WHEN "VA" MOVE "RJ" TO LS-NXT
        WHEN "AU" MOVE "RJ" TO LS-NXT
        WHEN "PR" MOVE "RJ" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-RETURN.
    EVALUATE LS-CUR
        WHEN "ST" MOVE "RT" TO LS-NXT
        WHEN "PR" MOVE "RT" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REVERSE.
    IF LS-CUR = "ST"
        MOVE "RV" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "CR" MOVE "CN" TO LS-NXT
        WHEN "VA" MOVE "CN" TO LS-NXT
        WHEN "AU" MOVE "CN" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID STATE TRANSITION" TO LS-MSG.
