IDENTIFICATION DIVISION.
PROGRAM-ID. BPAYPOST.

DATA DIVISION.
WORKING-STORAGE SECTION.
COPY "BKJRNP".
COPY "BKPSTT".

LINKAGE SECTION.
COPY "BPAYPSP".

PROCEDURE DIVISION USING BK-PAY-POST-REQ.
    MOVE "00" TO PPO-RC
    MOVE SPACES TO PPO-MSG
    MOVE SPACES TO BK-JRN-ID
    MOVE PPO-JRN-ID TO BK-JRN-ID
    MOVE PPO-TXN-ID TO BK-JRN-TXN-ID
    MOVE "PAYMENT" TO BK-JRN-TYPE
    MOVE PPO-BIZDATE TO BK-JRN-BIZDATE
    MOVE "PAY" TO BK-JRN-CHANNEL
    MOVE PPO-OPERATOR TO BK-JRN-OPERATOR
    MOVE PPO-CORR TO BK-JRN-CORR
    MOVE PPO-REQUEST TO BK-JRN-REQUEST
    MOVE 2 TO BK-JRN-COUNT
    MOVE "2000" TO BK-PST-GL(1)
    MOVE "D" TO BK-PST-DC(1)
    MOVE PPO-AMOUNT TO BK-PST-AMOUNT(1)
    MOVE PPO-CURRENCY TO BK-PST-CURRENCY(1)
    MOVE PPO-SRC TO BK-PST-ENTITY(1)
    MOVE PPO-DESCR TO BK-PST-DESCR(1)
    MOVE PPO-BIZDATE TO BK-PST-VALUEDATE(1)
    MOVE "2000" TO BK-PST-GL(2)
    MOVE "C" TO BK-PST-DC(2)
    MOVE PPO-AMOUNT TO BK-PST-AMOUNT(2)
    MOVE PPO-CURRENCY TO BK-PST-CURRENCY(2)
    MOVE PPO-DST TO BK-PST-ENTITY(2)
    MOVE PPO-DESCR TO BK-PST-DESCR(2)
    MOVE PPO-BIZDATE TO BK-PST-VALUEDATE(2)
    CALL "BGLPST" USING BK-JRN-PARMS BK-PST-TABLE
    MOVE BK-JRN-RC TO PPO-RC
    MOVE BK-JRN-MSG TO PPO-MSG.
