IDENTIFICATION DIVISION.
PROGRAM-ID. COLGST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(12).
01 LS-ACT PIC X(12).
01 LS-NXT PIC X(12).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "ACTIVATE" PERFORM DO-ACTIVATE
        WHEN "PARTIAL" PERFORM DO-PARTIAL
        WHEN "FULFILL" PERFORM DO-FULFILL
        WHEN "BREAK" PERFORM DO-BREAK
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "EXPIRE" PERFORM DO-EXPIRE
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN ARRANGEMENT ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-ACTIVATE.
    IF LS-CUR = "PROPOSED"
        MOVE "ACTIVE" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-PARTIAL.
    IF LS-CUR = "ACTIVE" OR LS-CUR = "PARTIALLY"
        MOVE "PARTIALLY" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-FULFILL.
    IF LS-CUR = "ACTIVE" OR LS-CUR = "PARTIALLY"
        MOVE "FULFILLED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-BREAK.
    IF LS-CUR = "ACTIVE" OR LS-CUR = "PARTIALLY"
        MOVE "BROKEN" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-CANCEL.
    IF LS-CUR = "PROPOSED" OR LS-CUR = "ACTIVE"
        OR LS-CUR = "PARTIALLY"
        MOVE "CANCELLED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-EXPIRE.
    IF LS-CUR = "PROPOSED"
        MOVE "EXPIRED" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID ARRANGEMENT TRANSITION" TO LS-MSG.
