IDENTIFICATION DIVISION.
PROGRAM-ID. COLST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(04).
01 LS-ACT PIC X(16).
01 LS-NXT PIC X(12).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "ACTIVATE" PERFORM DO-ACTIVATE
        WHEN "PROMISE" PERFORM DO-PROMISE
        WHEN "ARRANGE" PERFORM DO-ARRANGE
        WHEN "RECOVER-PART" PERFORM DO-RECOVER-PART
        WHEN "RECOVER-FULL" PERFORM DO-RECOVER-FULL
        WHEN "ESCALATE" PERFORM DO-ESCALATE
        WHEN "CLOSE" PERFORM DO-CLOSE
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "FAIL" PERFORM DO-FAIL
        WHEN "REOPEN" PERFORM DO-REOPEN
        WHEN "PROMISE-DONE" PERFORM DO-PROMISE-DONE
        WHEN "PROMISE-BROKEN" PERFORM DO-PROMISE-BROKEN
        WHEN "ARRANGE-DONE" PERFORM DO-ARRANGE-DONE
        WHEN "ARRANGE-BROKEN" PERFORM DO-ARRANGE-BROKEN
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN CASE ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-ACTIVATE.
    IF LS-CUR = "OPEN"
        MOVE "INCO" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-PROMISE.
    EVALUATE LS-CUR
        WHEN "INCO" MOVE "PPEN" TO LS-NXT
        WHEN "ESC" MOVE "PPEN" TO LS-NXT
        WHEN "PPEN" MOVE "PPEN" TO LS-NXT
        WHEN "PREC" MOVE "PPEN" TO LS-NXT
        WHEN "ARRA" MOVE "PPEN" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-ARRANGE.
    EVALUATE LS-CUR
        WHEN "INCO" MOVE "ARRA" TO LS-NXT
        WHEN "ESC" MOVE "ARRA" TO LS-NXT
        WHEN "PPEN" MOVE "ARRA" TO LS-NXT
        WHEN "PREC" MOVE "ARRA" TO LS-NXT
        WHEN "ARRA" MOVE "ARRA" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-RECOVER-PART.
    EVALUATE LS-CUR
        WHEN "INCO" MOVE "PREC" TO LS-NXT
        WHEN "ESC" MOVE "PREC" TO LS-NXT
        WHEN "PPEN" MOVE "PREC" TO LS-NXT
        WHEN "ARRA" MOVE "PREC" TO LS-NXT
        WHEN "PREC" MOVE "PREC" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-RECOVER-FULL.
    EVALUATE LS-CUR
        WHEN "INCO" MOVE "REC" TO LS-NXT
        WHEN "ESC" MOVE "REC" TO LS-NXT
        WHEN "PPEN" MOVE "REC" TO LS-NXT
        WHEN "ARRA" MOVE "REC" TO LS-NXT
        WHEN "PREC" MOVE "REC" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-ESCALATE.
    EVALUATE LS-CUR
        WHEN "OPEN" MOVE "ESC" TO LS-NXT
        WHEN "INCO" MOVE "ESC" TO LS-NXT
        WHEN "PPEN" MOVE "ESC" TO LS-NXT
        WHEN "ARRA" MOVE "ESC" TO LS-NXT
        WHEN "PREC" MOVE "ESC" TO LS-NXT
        WHEN "ESC" MOVE "ESC" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CLOSE.
    EVALUATE LS-CUR
        WHEN "REC" MOVE "CLOS" TO LS-NXT
        WHEN "PREC" MOVE "CLOS" TO LS-NXT
        WHEN "INCO" MOVE "CLOS" TO LS-NXT
        WHEN "ESC" MOVE "CLOS" TO LS-NXT
        WHEN "PPEN" MOVE "CLOS" TO LS-NXT
        WHEN "ARRA" MOVE "CLOS" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "OPEN" MOVE "CANC" TO LS-NXT
        WHEN "INCO" MOVE "CANC" TO LS-NXT
        WHEN "ESC" MOVE "CANC" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-FAIL.
    EVALUATE LS-CUR
        WHEN "OPEN" MOVE "FAIL" TO LS-NXT
        WHEN "INCO" MOVE "FAIL" TO LS-NXT
        WHEN "ESC" MOVE "FAIL" TO LS-NXT
        WHEN "PPEN" MOVE "FAIL" TO LS-NXT
        WHEN "ARRA" MOVE "FAIL" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-REOPEN.
    EVALUATE LS-CUR
        WHEN "CLOS" MOVE "INCO" TO LS-NXT
        WHEN "FAIL" MOVE "INCO" TO LS-NXT
        WHEN "CANC" MOVE "INCO" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-PROMISE-DONE.
    IF LS-CUR = "PPEN"
        MOVE "INCO" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-PROMISE-BROKEN.
    IF LS-CUR = "PPEN"
        MOVE "ESC" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-ARRANGE-DONE.
    IF LS-CUR = "ARRA"
        MOVE "INCO" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
DO-ARRANGE-BROKEN.
    IF LS-CUR = "ARRA"
        MOVE "ESC" TO LS-NXT
    ELSE
        PERFORM SET-INVALID
    END-IF.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID CASE TRANSITION" TO LS-MSG.
