IDENTIFICATION DIVISION.
PROGRAM-ID. BLNST.

DATA DIVISION.
WORKING-STORAGE SECTION.

LINKAGE SECTION.
01 LS-CUR PIC X(04).
01 LS-ACT PIC X(12).
01 LS-NXT PIC X(04).
01 LS-RC PIC X(02).
01 LS-MSG PIC X(80).

PROCEDURE DIVISION USING LS-CUR LS-ACT LS-NXT LS-RC LS-MSG.
    MOVE "00" TO LS-RC
    MOVE SPACES TO LS-MSG
    MOVE SPACES TO LS-NXT
    EVALUATE LS-ACT
        WHEN "APPROVE" PERFORM DO-APPROVE
        WHEN "CONTRACT" PERFORM DO-CONTRACT
        WHEN "ACTIVATE" PERFORM DO-ACTIVATE
        WHEN "SUSPEND" PERFORM DO-SUSPEND
        WHEN "RESUME" PERFORM DO-RESUME
        WHEN "DELINQUENT" PERFORM DO-DELINQUENT
        WHEN "DEFAULT" PERFORM DO-DEFAULT
        WHEN "MATURE" PERFORM DO-MATURE
        WHEN "SETTLE" PERFORM DO-SETTLE
        WHEN "CLOSE" PERFORM DO-CLOSE
        WHEN "CANCEL" PERFORM DO-CANCEL
        WHEN "RESTRUCTURE" PERFORM DO-RESTRUCTURE
        WHEN OTHER
            MOVE "20" TO LS-RC
            MOVE "UNKNOWN LOAN ACTION" TO LS-MSG
    END-EVALUATE
    GOBACK.

DO-APPROVE.
    IF LS-CUR = "REQ"
        MOVE "APV" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-CONTRACT.
    IF LS-CUR = "APV"
        MOVE "CON" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-ACTIVATE.
    IF LS-CUR = "CON"
        MOVE "ACT" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-SUSPEND.
    IF LS-CUR = "ACT"
        MOVE "SUS" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-RESUME.
    IF LS-CUR = "SUS"
        MOVE "ACT" TO LS-NXT
    ELSE
        PERFORM SET-INVALID.
DO-DELINQUENT.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "DFL" TO LS-NXT
        WHEN "SUS" MOVE "DFL" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-DEFAULT.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "DEF" TO LS-NXT
        WHEN "SUS" MOVE "DEF" TO LS-NXT
        WHEN "DFL" MOVE "DEF" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-MATURE.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "MAT" TO LS-NXT
        WHEN "SUS" MOVE "MAT" TO LS-NXT
        WHEN "DFL" MOVE "MAT" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-SETTLE.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "SET" TO LS-NXT
        WHEN "DFL" MOVE "SET" TO LS-NXT
        WHEN "DEF" MOVE "SET" TO LS-NXT
        WHEN "MAT" MOVE "SET" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CLOSE.
    EVALUATE LS-CUR
        WHEN "SET" MOVE "CLO" TO LS-NXT
        WHEN "MAT" MOVE "CLO" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-CANCEL.
    EVALUATE LS-CUR
        WHEN "REQ" MOVE "CAN" TO LS-NXT
        WHEN "APV" MOVE "CAN" TO LS-NXT
        WHEN "CON" MOVE "CAN" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
DO-RESTRUCTURE.
    EVALUATE LS-CUR
        WHEN "ACT" MOVE "CON" TO LS-NXT
        WHEN "DFL" MOVE "CON" TO LS-NXT
        WHEN "DEF" MOVE "CON" TO LS-NXT
        WHEN OTHER PERFORM SET-INVALID
    END-EVALUATE.
SET-INVALID.
    MOVE "20" TO LS-RC
    MOVE SPACES TO LS-NXT
    MOVE "INVALID LOAN TRANSITION" TO LS-MSG.
