       01 BK-CR-ENV.
          05 CEN-OP          PIC X(08).
          05 CEN-REQUEST     PIC X(24).
          05 CEN-OPERATION   PIC X(12).
          05 CEN-ENTITY      PIC X(12).
          05 CEN-STATUS      PIC X(04).
          05 CEN-MSG         PIC X(80).
          05 CEN-OPERATOR    PIC X(12).
          05 CEN-ACTION      PIC X(20).
          05 CEN-CORR        PIC X(24).
          05 CEN-EVT-PREFIX  PIC X(24).
          05 CEN-AMOUNT      PIC S9(15)V99 COMP-3.
          05 CEN-CURRENCY    PIC X(03).
          05 CEN-HIT         PIC X(01).
          05 CEN-RC          PIC X(02).
