       01 BK-CR-FAC-PARMS.
          05 CF-OP            PIC X(12).
          05 CF-FAC-ID        PIC X(12).
          05 CF-APP-ID        PIC X(12).
          05 CF-CUST-ID       PIC X(12).
          05 CF-PRODUCT       PIC X(04).
          05 CF-ACCOUNT       PIC X(12).
          05 CF-AMOUNT        PIC S9(15)V99 COMP-3.
          05 CF-TERM          PIC 9(04).
          05 CF-RATE-BPS      PIC S9(05).
          05 CF-EFF           PIC 9(08).
          05 CF-EXPIRES       PIC 9(08).
          05 CF-MATURITY      PIC 9(08).
          05 CF-COLLATERAL    PIC X(24).
          05 CF-CONDITIONS    PIC X(80).
          05 CF-REASON        PIC X(80).
          05 CF-OPERATOR      PIC X(12).
          05 CF-CORR          PIC X(24).
          05 CF-REQUEST       PIC X(24).
          05 CF-RC            PIC X(02).
          05 CF-MSG           PIC X(80).
