       01 BK-CR-QRY.
          05 CQ-OP            PIC X(08).
          05 CQ-TYPE          PIC X(08).
          05 CQ-ID            PIC X(12).
          05 CQ-RC            PIC X(02).
          05 CQ-MSG           PIC X(80).
