       01 BK-CR-WOF-PARMS.
          05 CW-FAC-ID        PIC X(12).
          05 CW-AMOUNT        PIC S9(15)V99 COMP-3.
          05 CW-REASON        PIC X(80).
          05 CW-OPERATOR      PIC X(12).
          05 CW-CORR          PIC X(24).
          05 CW-REQUEST       PIC X(24).
          05 CW-TXN-ID        PIC X(12).
          05 CW-RC            PIC X(02).
          05 CW-MSG           PIC X(80).
