       01 BK-DAT-PARMS.
          05 DAT-OP            PIC X(12).
          05 DAT-DATE          PIC 9(08).
          05 DAT-DATE2         PIC 9(08).
          05 DAT-DAYS          PIC S9(09).
          05 DAT-MONTHS        PIC S9(05).
          05 DAT-RESULT        PIC 9(08).
          05 DAT-RC            PIC X(02).
