       01 BK-IDM-PARMS.
          05 BK-IDM-TXN-ID     PIC X(24).
          05 BK-IDM-OPERATION  PIC X(12).
          05 BK-IDM-MODE       PIC X(01).
          05 BK-IDM-RESULT     PIC X(120).
          05 BK-IDM-STATUS     PIC X(02).
