       05 LN-ID             PIC X(12).
       05 LN-CUST-ID        PIC X(12).
       05 LN-FAC-ID         PIC X(12).
       05 LN-PRODUCT        PIC X(04).
       05 LN-ACCOUNT        PIC X(12).
       05 LN-STATUS         PIC X(04).
       05 LN-CURRENCY       PIC X(03).
       05 LN-PRINCIPAL      PIC S9(15)V99 COMP-3.
       05 LN-DISBURSED      PIC S9(15)V99 COMP-3.
       05 LN-PRINCIPAL-PAID PIC S9(15)V99 COMP-3.
       05 LN-PRINCIPAL-WO   PIC S9(15)V99 COMP-3.
       05 LN-OUTSTANDING    PIC S9(15)V99 COMP-3.
       05 LN-OVERDUE-PRIN   PIC S9(15)V99 COMP-3.
       05 LN-TERM           PIC 9(04).
       05 LN-BASIS          PIC 9(03).
       05 LN-RATE-BPS       PIC S9(05).
       05 LN-AMORT          PIC X(12).
       05 LN-FREQ           PIC 9(02).
       05 LN-ALLOC-ORDER    PIC X(16).
       05 LN-CONTRACT-DATE  PIC 9(08).
       05 LN-EFF-DATE       PIC 9(08).
       05 LN-FIRST-DUE      PIC 9(08).
       05 LN-MATURITY       PIC 9(08).
       05 LN-DISB-DATE      PIC 9(08).
       05 LN-DISB-TXN       PIC X(12).
       05 LN-INSTALLMENTS   PIC 9(04).
       05 LN-REASON         PIC X(80).
       05 LN-CREATED        PIC 9(08).
       05 LN-UPDATED        PIC 9(08).
       05 LN-VERSION        PIC 9(05).
       05 LN-HASH           PIC X(16).
