       01 BK-LN-QRY.
          05 CLQ-OP           PIC X(08).
          05 CLQ-LOAN-ID      PIC X(12).
          05 CLQ-NUMBER       PIC 9(04).
          05 CLQ-RC           PIC X(02).
