       01 BK-PAY-RES.
          05 PAY-RES-ID        PIC X(12).
          05 PAY-RES-STATUS    PIC X(02).
          05 PAY-RES-TXN-ID    PIC X(24).
          05 PAY-RES-JRN-ID    PIC X(20).
          05 PAY-RES-RC        PIC X(02).
          05 PAY-RES-MSG       PIC X(80).
