       01 BK-PAY-REQ.
          05 PAY-REQ-PAYID     PIC X(12).
          05 PAY-REQ-TYPE      PIC X(08).
          05 PAY-REQ-RAIL      PIC X(08).
          05 PAY-REQ-SRC       PIC X(12).
          05 PAY-REQ-DST       PIC X(12).
          05 PAY-REQ-AMOUNT    PIC S9(15)V99 COMP-3.
          05 PAY-REQ-CURRENCY  PIC X(03).
          05 PAY-REQ-DESCR     PIC X(40).
          05 PAY-REQ-OPERATOR  PIC X(12).
          05 PAY-REQ-CORR      PIC X(24).
          05 PAY-REQ-REQUEST   PIC X(24).
          05 PAY-REQ-IDEM      PIC X(24).
          05 PAY-REQ-MODE      PIC X(08).
          05 PAY-REQ-REASON    PIC X(40).
          05 PAY-REQ-ORIGIN    PIC X(12).
