       01 BK-PAY-STO-REQ.
          05 PS-OP           PIC X(08).
          05 PS-TXN-ID       PIC X(24).
          05 PS-JRN-ID       PIC X(20).
          05 PS-BIZDATE      PIC 9(08).
          05 PS-REASON       PIC X(40).
          05 PS-RC           PIC X(02).
          05 PS-MSG          PIC X(80).
