       10 PR-KEY.
          15 PR-ID          PIC X(04).
          15 PR-VERSION     PIC 9(05).
       10 PR-STATUS         PIC X(02).
       10 PR-NAME           PIC X(40).
       10 PR-TYPE           PIC X(08).
       10 PR-CURRENCY       PIC X(03).
       10 PR-EFF            PIC 9(08).
       10 PR-MIN-BAL        PIC S9(15)V99 COMP-3.
       10 PR-DAILY-LIMIT    PIC S9(15)V99 COMP-3.
       10 PR-MONTHLY-LIMIT  PIC S9(15)V99 COMP-3.
       10 PR-INTEREST-BPS   PIC S9(05).
       10 PR-FEE            PIC S9(15)V99 COMP-3.
       10 PR-MIN-AMOUNT     PIC S9(15)V99 COMP-3.
       10 PR-MAX-AMOUNT     PIC S9(15)V99 COMP-3.
       10 PR-MAX-TERM       PIC 9(04).
       10 PR-BASIS          PIC 9(03).
       10 PR-ALLOC-ORDER    PIC X(16).
       10 PR-AMORT          PIC X(12).
       10 PR-FREQ           PIC 9(02).
       10 PR-HASH           PIC X(16).
