       05 PX-ID             PIC X(12).
       05 PX-DIRECTION      PIC X(08).
       05 PX-MODALITY       PIC X(12).
       05 PX-ENV            PIC X(08).
       05 PX-E2E-ID         PIC X(32).
       05 PX-EXT-REF        PIC X(32).
       05 PX-KEY-ID         PIC X(12).
       05 PX-KEY-TYPE       PIC X(10).
       05 PX-KEY-MASK       PIC X(30).
       05 PX-QR-ID          PIC X(12).
       05 PX-ORIG-PIX-ID    PIC X(12).
       05 PX-DEV-PIX-ID     PIC X(12).
       05 PX-MED-CASE       PIC X(12).
       05 PX-PAYER-PART     PIC X(12).
       05 PX-PAYEE-PART     PIC X(12).
       05 PX-PAYER-ACCT     PIC X(12).
       05 PX-PAYER-CUST     PIC X(12).
       05 PX-PAYEE-ACCT     PIC X(12).
       05 PX-PAYEE-CUST     PIC X(12).
       05 PX-PAYEE-NAME     PIC X(60).
       05 PX-MERCHANT-ID    PIC X(16).
       05 PX-MERCHANT-NAME  PIC X(40).
       05 PX-MCC            PIC X(04).
       05 PX-AMOUNT         PIC S9(15)V99 COMP-3.
       05 PX-CURRENCY       PIC X(03).
       05 PX-FEE-AMT        PIC S9(15)V99 COMP-3.
       05 PX-BLOCK-AMT      PIC S9(15)V99 COMP-3.
       05 PX-STATUS         PIC X(12).
       05 PX-POST-STATUS    PIC X(12).
       05 PX-SETTLE-STATUS  PIC X(12).
       05 PX-RECON-STATUS   PIC X(12).
       05 PX-DEV-STATUS     PIC X(12).
       05 PX-MED-STATUS     PIC X(12).
       05 PX-TXN-ID         PIC X(12).
       05 PX-JRN-ID         PIC X(20).
       05 PX-SETTLE-BATCH   PIC X(12).
       05 PX-CHANNEL        PIC X(08).
       05 PX-REASON         PIC X(40).
       05 PX-DESCR          PIC X(40).
       05 PX-OPERATOR       PIC X(12).
       05 PX-CORR           PIC X(24).
       05 PX-REQUEST        PIC X(24).
       05 PX-IDEM-KEY       PIC X(64).
       05 PX-BIZDATE        PIC 9(08).
       05 PX-ACCEPT-DATE    PIC 9(08).
       05 PX-POST-DATE      PIC 9(08).
       05 PX-SETTLE-DATE    PIC 9(08).
       05 PX-RECON-DATE     PIC 9(08).
       05 PX-EXPIRE-DATE    PIC 9(08).
       05 PX-CREATED        PIC 9(14).
       05 PX-UPDATED        PIC 9(14).
       05 PX-VERSION        PIC 9(05).
       05 PX-HASH           PIC X(16).
