       01 BK-PX-CFG.
          05 PC-STATUS         PIC X(02).
          05 PC-ENABLED        PIC X(01).
          05 PC-RAIL           PIC X(08).
          05 PC-SELF           PIC X(12).
          05 PC-CURRENCY       PIC X(03).
          05 PC-ADAPTER        PIC X(12).
          05 PC-E2E-ISPB       PIC X(08).
          05 PC-AMOUNT-MAX     PIC S9(15)V99 COMP-3.
          05 PC-KEY-LIMIT      PIC 9(04).
          05 PC-QR-TTL         PIC 9(06).
          05 PC-DEV-DAYS       PIC 9(04).
          05 PC-MED-DAYS       PIC 9(04).
          05 PC-STALE-DAYS     PIC 9(04).
          05 PC-EXPIRE-DAYS    PIC 9(04).
          05 PC-SIMULATE       PIC X(12).
          05 PC-STL-LAG        PIC 9(04).
          05 PC-STL-ACCT      PIC X(10).
          05 PC-STL-CASH      PIC X(10).
