       01 BK-PX-FRD-STO-REQ.
          05 FD-OP             PIC X(14).
          05 FD-RC             PIC X(02).
          05 FD-MSG            PIC X(80).
