       01 BK-PX-FRD-PARMS.
          05 FP-OP             PIC X(14).
          05 FP-TARGET-TYPE    PIC X(10).
          05 FP-TARGET-KEY     PIC X(32).
          05 FP-FLAG-SEND      PIC X(01).
          05 FP-FLAG-RECV      PIC X(01).
          05 FP-FLAG-KEY       PIC X(01).
          05 FP-SOURCE         PIC X(12).
          05 FP-REF            PIC X(32).
          05 FP-REASON         PIC X(40).
          05 FP-STATUS         PIC X(12).
          05 FP-DIRECTION      PIC X(08).
          05 FP-OPERATOR       PIC X(12).
          05 FP-CORR           PIC X(24).
          05 FP-REQUEST        PIC X(24).
          05 FP-RC             PIC X(02).
          05 FP-MSG            PIC X(80).
