       05 PF-KEY.
          10 PF-TARGET-TYPE    PIC X(10).
          10 PF-SEP            PIC X(01).
          10 PF-TARGET-KEY     PIC X(32).
       05 PF-FLAG-SEND        PIC X(01).
       05 PF-FLAG-RECV        PIC X(01).
       05 PF-FLAG-KEY         PIC X(01).
       05 PF-SOURCE           PIC X(12).
       05 PF-REF              PIC X(32).
       05 PF-REASON           PIC X(40).
       05 PF-STATUS           PIC X(12).
       05 PF-BIZDATE          PIC 9(08).
       05 PF-CREATED          PIC 9(14).
       05 PF-UPDATED          PIC 9(14).
       05 PF-VERSION          PIC 9(05).
       05 PF-HASH             PIC X(16).
