       01 BK-PX-KEY-STO-REQ.
          05 KS-OP             PIC X(16).
          05 KS-COUNT          PIC 9(04).
          05 KS-RC             PIC X(02).
          05 KS-MSG            PIC X(80).
