       05 PK-ID             PIC X(12).
       05 PK-TYPE           PIC X(10).
       05 PK-VALUE-HASH     PIC X(16).
       05 PK-MASK           PIC X(30).
       05 PK-CUST           PIC X(12).
       05 PK-ACCT           PIC X(12).
       05 PK-PART           PIC X(12).
       05 PK-SELF           PIC X(01).
       05 PK-STATUS         PIC X(12).
       05 PK-CLAIM          PIC X(12).
       05 PK-FRAUD          PIC X(01).
       05 PK-BIZDATE        PIC 9(08).
       05 PK-ACTIVE-DATE    PIC 9(08).
       05 PK-END-DATE       PIC 9(08).
       05 PK-CREATED        PIC 9(14).
       05 PK-UPDATED        PIC 9(14).
       05 PK-VERSION        PIC 9(05).
       05 PK-HASH           PIC X(16).
