       01 BK-MC-STO-REQ.
          05 MC-SO-OP            PIC X(14).
          05 MC-SO-CASE-ID       PIC X(12).
          05 MC-SO-REQ-ID        PIC X(24).
          05 MC-SO-PIXKEY.
             10 MC-SO-PIXID      PIC X(12).
             10 MC-SO-SEPA       PIC X(01).
             10 MC-SO-PREASON    PIC X(40).
          05 MC-SO-RC            PIC X(02).
          05 MC-SO-MSG           PIC X(80).
