       05 MH-HOLD-ID        PIC X(16).
       05 MH-ACCT           PIC X(12).
       05 MH-CURRENCY       PIC X(03).
       05 MH-AMOUNT         PIC S9(15)V99 COMP-3.
       05 MH-ORIG-PIX-ID    PIC X(12).
       05 MH-MED-CASE-ID    PIC X(12).
       05 MH-STATUS         PIC X(10).
       05 MH-BIZDATE        PIC 9(08).
       05 MH-CREATED        PIC 9(14).
       05 MH-UPDATED        PIC 9(14).
       05 MH-VERSION        PIC 9(05).
