       01 BK-MH-STO-REQ.
          05 MH-SO-OP            PIC X(14).
          05 MH-SO-HOLD-ID       PIC X(16).
          05 MH-SO-RC            PIC X(02).
          05 MH-SO-MSG           PIC X(80).
