       01 BK-PX-QR-PARMS.
          05 XQ-OP             PIC X(16).
          05 XQ-QR-ID          PIC X(12).
          05 XQ-QR-TYPE        PIC X(12).
          05 XQ-ENV            PIC X(08).
          05 XQ-PART           PIC X(12).
          05 XQ-ACCT           PIC X(12).
          05 XQ-CUST           PIC X(12).
          05 XQ-PAYEE-NAME     PIC X(60).
          05 XQ-MERCHANT-ID    PIC X(16).
          05 XQ-MERCHANT-NAME  PIC X(40).
          05 XQ-CITY           PIC X(15).
          05 XQ-MCC            PIC X(04).
          05 XQ-COUNTRY        PIC X(02).
          05 XQ-CURRENCY       PIC X(03).
          05 XQ-AMOUNT         PIC S9(15)V99 COMP-3.
          05 XQ-TXID           PIC X(32).
          05 XQ-KEY-ID         PIC X(12).
          05 XQ-KEY-TYPE       PIC X(10).
          05 XQ-KEY-MASK       PIC X(30).
          05 XQ-KEY-VALUE      PIC X(60).
          05 XQ-KEY-HASH       PIC X(16).
          05 XQ-GUID           PIC X(32).
          05 XQ-MAI            PIC X(32).
          05 XQ-URL            PIC X(100).
          05 XQ-Payload        PIC X(500).
          05 XQ-CRC            PIC X(04).
          05 XQ-STATUS         PIC X(12).
          05 XQ-PIX-ID         PIC X(12).
          05 XQ-READ-COUNT     PIC 9(05).
          05 XQ-TTL            PIC 9(06).
          05 XQ-DATE           PIC 9(08).
          05 XQ-CREATE-DATE    PIC 9(08).
          05 XQ-EXPIRE-DATE    PIC 9(08).
          05 XQ-REPLAY         PIC X(01).
          05 XQ-OPERATOR       PIC X(12).
          05 XQ-CORR           PIC X(24).
          05 XQ-REQUEST        PIC X(24).
          05 XQ-REASON         PIC X(40).
          05 XQ-RC             PIC X(02).
          05 XQ-MSG            PIC X(80).
