       05 QR-ID             PIC X(12).
       05 QR-TYPE           PIC X(12).
       05 QR-ENV            PIC X(08).
       05 QR-PART           PIC X(12).
       05 QR-ACCT           PIC X(12).
       05 QR-CUST           PIC X(12).
       05 QR-PAYEE-NAME     PIC X(60).
       05 QR-MERCHANT-ID    PIC X(16).
       05 QR-MERCHANT-NAME  PIC X(40).
       05 QR-CITY           PIC X(15).
       05 QR-MCC            PIC X(04).
       05 QR-COUNTRY        PIC X(02).
       05 QR-CURRENCY       PIC X(03).
       05 QR-AMOUNT         PIC S9(15)V99 COMP-3.
       05 QR-TXID           PIC X(32).
       05 QR-KEY-ID         PIC X(12).
       05 QR-KEY-TYPE       PIC X(10).
       05 QR-KEY-MASK       PIC X(30).
       05 QR-KEY-HASH       PIC X(16).
       05 QR-GUID           PIC X(32).
       05 QR-MAI            PIC X(32).
       05 QR-URL            PIC X(100).
       05 QR-Payload        PIC X(500).
       05 QR-CRC            PIC X(04).
       05 QR-STATUS         PIC X(12).
       05 QR-PIX-ID         PIC X(12).
       05 QR-READ-COUNT     PIC 9(05).
       05 QR-CREATE-DATE    PIC 9(08).
       05 QR-TTL            PIC 9(06).
       05 QR-EXPIRE-DATE    PIC 9(08).
       05 QR-BIZDATE        PIC 9(08).
       05 QR-CREATED        PIC 9(14).
       05 QR-UPDATED        PIC 9(14).
       05 QR-VERSION        PIC 9(05).
       05 QR-HASH           PIC X(16).
