       01 BK-PX-QR-STO-REQ.
          05 QS-OP             PIC X(14).
          05 QS-RC             PIC X(02).
          05 QS-MSG            PIC X(80).
