       05 SR-STL-ID        PIC X(12).
       05 SR-CYCLE-ID      PIC X(20).
       05 SR-PARTICIPANT   PIC X(12).
       05 SR-BATCH         PIC X(12).
       05 SR-BIZDATE       PIC 9(08).
       05 SR-SETTLE-DATE   PIC 9(08).
       05 SR-CURRENCY      PIC X(03).
       05 SR-SIDE          PIC X(10).
       05 SR-GROSS-AMT     PIC S9(15)V99 COMP-3.
       05 SR-ADJ-AMT       PIC S9(15)V99 COMP-3.
       05 SR-FEE-AMT       PIC S9(15)V99 COMP-3.
       05 SR-NET-AMT       PIC S9(15)V99 COMP-3.
       05 SR-ITEM-COUNT    PIC 9(07).
       05 SR-SETTLED-AMT   PIC S9(15)V99 COMP-3.
       05 SR-STATUS        PIC X(16).
       05 SR-EXTERNAL-REF  PIC X(32).
       05 SR-RESULT-REF    PIC X(32).
       05 SR-POST-STATUS   PIC X(12).
       05 SR-RECON-STATUS  PIC X(12).
       05 SR-JRN-ID        PIC X(20).
       05 SR-OPERATOR      PIC X(12).
       05 SR-CORR          PIC X(24).
       05 SR-REASON        PIC X(40).
       05 SR-ATTEMPTS      PIC 9(04).
       05 SR-CREATED       PIC 9(14).
       05 SR-UPDATED       PIC 9(14).
       05 SR-SETTLED       PIC 9(14).
       05 SR-RECONCILED    PIC 9(14).
       05 SR-VERSION       PIC 9(05).
