       01 BK-PX-STO-REQ.
          05 XS-OP             PIC X(14).
          05 XS-E2E-ID         PIC X(32).
          05 XS-XREF-KEY       PIC X(48).
          05 XS-PIX-ID         PIC X(12).
          05 XS-RC             PIC X(02).
          05 XS-MSG            PIC X(80).
