       01 BK-PX-RT-STO-REQ.
          05 PT-OP             PIC X(14).
          05 PT-RC             PIC X(02).
          05 PT-MSG            PIC X(80).
