       01 BK-PX-SPI-PARMS.
          05 SI-OP             PIC X(14).
          05 SI-ADAPTER        PIC X(12).
          05 SI-SIM            PIC X(12).
          05 SI-E2E-ID         PIC X(32).
          05 SI-AMOUNT         PIC S9(15)V99 COMP-3.
          05 SI-CURRENCY       PIC X(03).
          05 SI-PAYER-PART     PIC X(12).
          05 SI-PAYEE-PART     PIC X(12).
          05 SI-RESULT         PIC X(12).
          05 SI-EXT-REF        PIC X(32).
          05 SI-RC             PIC X(02).
          05 SI-MSG            PIC X(80).
