       01 BK-TXN-RES.
          05 TXR-ID            PIC X(12).
          05 TXR-STATUS        PIC X(02).
          05 TXR-TYPE          PIC X(08).
          05 TXR-AMOUNT        PIC S9(15)V99 COMP-3.
          05 TXR-JRN-ID        PIC X(20).
          05 TXR-RC            PIC X(02).
          05 TXR-MSG           PIC X(80).
