       01 BK-CCRD-STO-AUTH.
          05 SA-OP            PIC X(08).
          05 SA-RC            PIC X(02).
          05 SA-MSG           PIC X(80).
