       01 BK-CCRD-STO-CLR.
          05 SC-OP             PIC X(14).
          05 SC-RC             PIC X(02).
          05 SC-MSG            PIC X(80).
