       01 BK-CCRD-STO-EXC.
          05 SX-OP             PIC X(12).
          05 SX-RC             PIC X(02).
          05 SX-MSG            PIC X(80).
          05 SX-COUNT          PIC 9(05).
