       01 BK-CCRD-STO-HOLD.
          05 SH-OP            PIC X(08).
          05 SH-RC            PIC X(02).
          05 SH-MSG           PIC X(80).
