       01 BK-CCRD-STO-MATCH.
          05 SM-OP             PIC X(08).
          05 SM-RC             PIC X(02).
          05 SM-MSG            PIC X(80).
