       01 BK-CCRD-STO-SETTLE.
          05 SS-OP             PIC X(08).
          05 SS-RC             PIC X(02).
          05 SS-MSG            PIC X(80).
