       05 CS-ID             PIC X(12).
       05 CS-SOURCE         PIC X(08).
       05 CS-BIZDATE        PIC 9(08).
       05 CS-SETTLE-DATE    PIC 9(08).
       05 CS-CURRENCY       PIC X(03).
       05 CS-TOTAL-COUNT    PIC 9(07).
       05 CS-TOTAL-AMT      PIC S9(15)V99 COMP-3.
       05 CS-DECL-COUNT     PIC 9(07).
       05 CS-DECL-AMT       PIC S9(15)V99 COMP-3.
       05 CS-STATUS         PIC X(12).
       05 CS-RECON-STATUS   PIC X(12).
       05 CS-OPERATOR       PIC X(12).
       05 CS-TXN-ID         PIC X(12).
       05 CS-CREATED        PIC 9(14).
       05 CS-UPDATED        PIC 9(14).
       05 CS-VERSION        PIC 9(05).
