       05 AA-ID             PIC X(12).
       05 AA-COLL-ID        PIC X(12).
       05 AA-OBL-TYPE       PIC X(08).
       05 AA-OBL-ID         PIC X(12).
       05 AA-FAC-ID         PIC X(12).
       05 AA-CUST-ID        PIC X(12).
       05 AA-AMOUNT         PIC S9(15)V99 COMP-3.
       05 AA-CURRENCY       PIC X(03).
       05 AA-PRIORITY       PIC 9(04).
       05 AA-STATUS         PIC X(12).
       05 AA-ALLOC-DATE     PIC 9(08).
       05 AA-RELEASE-DATE   PIC 9(08).
       05 AA-REASON         PIC X(80).
       05 AA-OPERATOR       PIC X(12).
       05 AA-CREATED        PIC 9(08).
       05 AA-UPDATED        PIC 9(08).
       05 AA-VERSION        PIC 9(05).
       05 AA-HASH           PIC X(16).
