       05 SU-ID             PIC X(12).
       05 SU-SRC-COLL       PIC X(12).
       05 SU-DST-COLL       PIC X(12).
       05 SU-SRC-ALLOC      PIC X(12).
       05 SU-DST-ALLOC      PIC X(12).
       05 SU-OBL-TYPE       PIC X(08).
       05 SU-OBL-ID         PIC X(12).
       05 SU-AMOUNT         PIC S9(15)V99 COMP-3.
       05 SU-CURRENCY       PIC X(03).
       05 SU-STATUS         PIC X(12).
       05 SU-EFF-DATE       PIC 9(08).
       05 SU-REASON         PIC X(80).
       05 SU-OPERATOR       PIC X(12).
       05 SU-CREATED        PIC 9(08).
       05 SU-UPDATED        PIC 9(08).
       05 SU-VERSION        PIC 9(05).
       05 SU-HASH           PIC X(16).
