       01 BK-COL-QRY.
          05 OQ-OP            PIC X(08).
          05 OQ-ID            PIC X(12).
          05 OQ-CASE          PIC X(12).
          05 OQ-RC            PIC X(02).
          05 OQ-MSG           PIC X(80).
