//KOFBUILD JOB (BANK),'BUILD CORE',
//             CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//* MAINFRAME BUILD SKELETON
//COB      EXEC PGM=IGYCRCTL,REGION=0M,
//             PARM='RENT,APOST,OPTIMIZE'
//STEPLIB  DD DSN=SYS1.IGY.SIGYCOMP,DISP=SHR
//SYSPRINT DD SYSOUT=*
//SYSIN    DD DSN=&SYSUID..BANK.COBOL(&MEMBER),DISP=SHR
//SYSLIN   DD DSN=&&OBJ,DISP=(NEW,PASS),UNIT=SYSDA,
//             SPACE=(CYL,(10,5))
//LKED     EXEC PGM=HEWL,PARM='RENT,AMODE=31,RMODE=ANY'
//SYSLIB   DD DSN=CEE.SCEELKED,DISP=SHR
//SYSLIN   DD DSN=&&OBJ,DISP=(OLD,DELETE)
//SYSLMOD  DD DSN=&SYSUID..BANK.LOAD(&MEMBER),DISP=SHR
