//KOFEOD   JOB (BANK),'END OF DAY',
//             CLASS=A,MSGCLASS=X,NOTIFY=&SYSUID
//* END OF DAY ORCHESTRATION SKELETON
//EOD      EXEC PGM=BBATEOD,REGION=0M
//STEPLIB  DD DSN=&SYSUID..BANK.LOAD,DISP=SHR
//CUST     DD DSN=&SYSUID..BANK.CUST,DISP=SHR
//ACCT     DD DSN=&SYSUID..BANK.ACCT,DISP=SHR
//ACCTBAL  DD DSN=&SYSUID..BANK.ACCTBAL,DISP=SHR
//TXN      DD DSN=&SYSUID..BANK.TXN,DISP=SHR
//JOURNAL  DD DSN=&SYSUID..BANK.JOURNAL,DISP=SHR
//POSTINGS DD DSN=&SYSUID..BANK.POSTINGS,DISP=SHR
//REC      DD DSN=&SYSUID..BANK.REC,DISP=SHR
//RECEXC   DD DSN=&SYSUID..BANK.RECEXC,DISP=SHR
//REPORT   DD DSN=&SYSUID..BANK.EOD.REPORT,DISP=(NEW,CATLG,DELETE),
//             UNIT=SYSDA,SPACE=(CYL,(5,5)),
//             DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)
//SYSOUT   DD SYSOUT=*
//CEEDUMP  DD SYSOUT=*
